In [1]:
import pandas as pd

In [2]:
data = [['Aman',74], ['jill', 62], ['Jacon', 34], ['Subham', 89]]

In [12]:
data

[['Aman', 74], ['jill', 62], ['Jacon', 34], ['Subham', 89]]

In [6]:
pd.DataFrame(data, columns=["Name", "Marks"])

     Name  Marks
0    Aman     74
1    jill     62
2   Jacon     34
3  Subham     89

In [13]:
data = {"a": [1,2,3], "b": [4,5,6]}

In [14]:
data

{'a': [1, 2, 3], 'b': [4, 5, 6]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

   a  b
0  1  4
1  2  5
2  3  6

In [2]:
import numpy as np

In [18]:
arr = np.array([[1,2], [3,4]])

In [21]:
df = pd.DataFrame(arr, columns=["A", "B"])

In [22]:
df

   A  B
0  1  2
1  3  4